/*

*/
// 1. Створити сторінку, яка містить зображення (мапу скарбів) та місце для виведення повідомлень
// 2. Обрати випадкове місце на зображенні мапи де буде заховано скарб
// 3. Створити обробник кліків. Кожного разу, коли гравець клікатиме по мапі, обробник кліків виконуватиме наступні дії
// 3.1. Додаватиме 1 до лічильника кліків
// 3.2. Вираховуватиме, як далеко від скарбу знаходиться те місце, де клікнув гравець
// 3.3. Показуватиме повідомлення на веб-сторінці, аби інформувати гравця "гаряче" чи "холодно", тобто близько чи далеко він чи вона від скарбу.
// 3.4. Вітатиме гравця, якщо він чи вона клікне по локації скарбу або дуже близько до нього, і сповіщатиме, скільки кліків знадобилося гравцю, щоб знайти скарб.